from mandosubmem.ext import parse_srt


def test_parse_srt():
    t_str = """1
00:02:38,166 --> 00:02:39,466
现在？

2
00:06:48,433 --> 00:06:50,466
人力资源部 人事升迁审查

3
00:06:50,700 --> 00:06:54,800
10点到11点 广告公司会来提出
明年度饭店的形象提案"""
    answer = [
        "现在？",
        "人力资源部 人事升迁审查",
        "10点到11点 广告公司会来提出",
        "明年度饭店的形象提案",
    ]
    assert parse_srt(t_str) == answer


def test_parse_srt_bad_index():
    t_str = """1
00:02:38,166 --> 00:02:39,466
现在？

00:06:48,433 --> 00:06:50,466
人力资源部 人事升迁审查

3
00:06:50,700 --> 00:06:54,800
10点到11点 广告公司会来提出
明年度饭店的形象提案"""
    answer = [
        "现在？",
        "10点到11点 广告公司会来提出",
        "明年度饭店的形象提案",
    ]
    assert parse_srt(t_str) == answer


def test_parse_srt_bad_time():
    t_str = """1
00:02:38,166 --> 00:02:39,466
现在？

2
06:48,433 --> 00:06:50,466
人力资源部 人事升迁审查

3
10点到11点 广告公司会来提出
明年度饭店的形象提案"""
    answer = ["现在？"]
    assert parse_srt(t_str) == answer
